

export const hardcodedTranslations: { [key: string]: { [key: string | number]: string } } = {
  continents: {
    "World": "العالم",
    "Europe": "أوروبا",
    "Asia": "آسيا",
    "Africa": "أفريقيا",
    "South America": "أمريكا الجنوبية",
    "North America": "أمريكا الشمالية",
    "Oceania": "أوقيانوسيا",
    "Other": "أخرى"
  },
  countries: {
    // Empty as per user request. Admin can add custom names via the UI.
  },
  leagues: {
    2: "دوري أبطال أوروبا",
    3: "الدوري الأوروبي",
    39: "الدوري الإنجليزي الممتاز",
    140: "الدوري الإسباني",
    135: "الدوري الإيطالي",
    78: "الدوري الألماني",
    61: "الدوري الفرنسي",
    307: "دوري روشن السعودي",
    542: "دوري نجوم العراق",
    253: "الدوري الأمريكي",
    1: "كأس العالم",
    4: "بطولة أمم أوروبا",
    9: "كوبا أمريكا",
    6: "كأس الأمم الأفريقية",
    884: "كأس آسيا",
    7: "دوري أبطال أفريقيا",
    14: "دوري أبطال آسيا",
    11: "كأس ليبرتادوريس",
    310: "دوري نجوم قطر",
    304: "دوري أدنوك للمحترفين",
    203: "الدوري المصري الممتاز",
    200: "البطولة الإحترافية",
    202: "الرابطة المحترفة الأولى",
    199: "الرابطة المحترفة الأولى الجزائرية",
    848: "دوري المؤتمر الأوروبي",
    40: "دوري البطولة الإنجليزية",
    143: "كأس ملك إسبانيا",
    45: "كأس الاتحاد الإنجليزي",
    71: "الدوري البرازيلي",
    128: "الدوري الأرجنتيني",
    88: "الدوري الهولندي",
    94: "الدوري البرتغالي",
    197: "الدوري التركي الممتاز",
  },
  teams: {
    // Empty as requested by user, admin can add via UI.
  },
  players: {
    // Empty as requested by the user
  }
};
